In [1]:
import pandas as pd
import numpy as np

# For reading stock data from yahoo
from pandas_datareader.data import DataReader
import yfinance as yf
from pandas_datareader import data as pdr
yf.pdr_override()

# For time stamps
from datetime import datetime
import json
from pymongo import MongoClient

In [2]:

df = pdr.get_data_yahoo('MSFT', start='2012-01-01', end=datetime.now())

[*********************100%***********************]  1 of 1 completed

In [3]:
df.head()

                 Open       High        Low      Close  Adj Close    Volume
Date
2012-01-03  26.549999  26.959999  26.389999  26.770000  21.413069  64731500
2012-01-04  26.820000  27.469999  26.780001  27.400000  21.916996  80516100
2012-01-05  27.379999  27.730000  27.290001  27.680000  22.140965  56081400
2012-01-06  27.530001  28.190001  27.530001  28.110001  22.484921  99455500
2012-01-09  28.049999  28.100000  27.719999  27.740000  22.188951  59706800

In [4]:
df.reset_index(inplace=True)

In [5]:
df.head()

        Date       Open       High        Low      Close  Adj Close    Volume
0 2012-01-03  26.549999  26.959999  26.389999  26.770000  21.413069  64731500
1 2012-01-04  26.820000  27.469999  26.780001  27.400000  21.916996  80516100
2 2012-01-05  27.379999  27.730000  27.290001  27.680000  22.140965  56081400
3 2012-01-06  27.530001  28.190001  27.530001  28.110001  22.484921  99455500
4 2012-01-09  28.049999  28.100000  27.719999  27.740000  22.188951  59706800

In [6]:
# connect to mongodb 
client = MongoClient("mongodb+srv://Stock_db:13579mongo@cluster0.1mly3bn.mongodb.net/test")  # connect to localhost mongodb instance 
db = client['stock-market']  # create a database named my_database 
collection = db['MSFT-data']  # create a collection named my_collection in the database my_database 
data = df.to_dict(orient='records')  # Here's our added param..
collection.insert_many(data)

In [7]:
df = pd.DataFrame(list(collection.find()))
if "_id" in df.columns.to_list():
    df = df.drop(columns=["_id"], axis=
df.replace({"na": np.nan}, inplace=True))

df.head()

        Date       Open       High        Low      Close  Adj Close    Volume
0 2012-01-03  26.549999  26.959999  26.389999  26.770000  21.413069  64731500
1 2012-01-04  26.820000  27.469999  26.780001  27.400000  21.916996  80516100
2 2012-01-05  27.379999  27.730000  27.290001  27.680000  22.140965  56081400
3 2012-01-06  27.530001  28.190001  27.530001  28.110001  22.484921  99455500
4 2012-01-09  28.049999  28.100000  27.719999  27.740000  22.188951  59706800